#include <iostream>
#include <memory>

#include <UHH2/core/include/AnalysisModule.h>
#include <UHH2/core/include/Event.h>
#include <UHH2/core/include/Selection.h>
#include "UHH2/common/include/PrintingModules.h"

#include <UHH2/common/include/CleaningModules.h>
#include <UHH2/common/include/NSelections.h>
#include <UHH2/common/include/LumiSelection.h>
#include <UHH2/common/include/TriggerSelection.h>
#include <UHH2/common/include/JetCorrections.h>
#include <UHH2/common/include/ObjectIdUtils.h>
#include <UHH2/common/include/MuonIds.h>
#include <UHH2/common/include/ElectronIds.h>
#include <UHH2/common/include/JetIds.h>
#include <UHH2/common/include/TopJetIds.h>
#include <UHH2/common/include/TTbarGen.h>
#include <UHH2/common/include/Utils.h>
#include <UHH2/common/include/AdditionalSelections.h>
#include "UHH2/common/include/LuminosityHists.h"

#include <UHH2/ZprimeSemiLeptonic/include/ModuleBASE.h>
#include <UHH2/ZprimeSemiLeptonic/include/ZprimeSemiLeptonicSelections.h>
#include <UHH2/ZprimeSemiLeptonic/include/ZprimeSemiLeptonicUtils.h>
#include <UHH2/ZprimeSemiLeptonic/include/TTbarLJHistsSkimming.h>

class TTbarLJSkimmingModule : public ModuleBASE {

 public:
  explicit TTbarLJSkimmingModule(uhh2::Context&);
  virtual bool process(uhh2::Event&) override;

 protected:

  // cleaners
  std::unique_ptr<MuonCleaner>     muoSR_cleaner;
  std::unique_ptr<ElectronCleaner> eleSR_cleaner;

  std::unique_ptr<TopJetCorrector> topjet_corrector;
  std::unique_ptr<GenericTopJetCorrector> toppuppijet_corrector;

  std::unique_ptr<JetCleaner>                      jet_IDcleaner;
  //split corrections by run periods 
  std::unique_ptr<JetCorrector>                    jet_corrector, jet_corrector_BCD, jet_corrector_EFearly, jet_corrector_FlateG, jet_corrector_H;
  std::unique_ptr<GenericJetResolutionSmearer>     jetER_smearer;
  //split cleaners by run periods 
  std::unique_ptr<JetLeptonCleaner_by_KEYmatching> jetlepton_cleaner, JLC_BCD, JLC_EFearly, JLC_FlateG, JLC_H;
  //  std::unique_ptr<JetLeptonCleaner> jetlepton_cleaner, JLC_BCD, JLC_EFearly, JLC_FlateG, JLC_H;//TEST

  std::unique_ptr<JetCleaner>                      jet_cleaner1;
  std::unique_ptr<JetCleaner>                      jet_cleaner2;
  std::unique_ptr<TopJetCleaner>                  topjet_IDcleaner;
  std::unique_ptr<SubJetCorrector>             topjet_subjet_corrector, topjet_subjet_corrector_BCD, topjet_subjet_corrector_EF, topjet_subjet_corrector_G, topjet_subjet_corrector_H;
  std::unique_ptr<GenericJetResolutionSmearer> topjetER_smearer;
  //  std::unique_ptr<TopJetLeptonDeltaRCleaner>   topjetlepton_cleaner;
  std::unique_ptr<JetLeptonCleaner_by_KEYmatching> topjetlepton_cleaner;
  std::unique_ptr<TopJetCleaner>               topjet_cleaner;

  std::unique_ptr<TopJetCleaner>               toppuppijet_IDcleaner;
  std::unique_ptr<GenericSubJetCorrector>      toppuppijet_subjet_corrector, toppuppijet_subjet_corrector_BCD, toppuppijet_subjet_corrector_EF, toppuppijet_subjet_corrector_G, toppuppijet_subjet_corrector_H;
  std::unique_ptr<GenericJetResolutionSmearer> toppuppijetER_smearer;
  std::unique_ptr<JetLeptonCleaner_by_KEYmatching> toppuppijetlepton_cleaner;
  std::unique_ptr<TopJetCleaner>               toppuppijet_cleaner;

  // selections
  std::unique_ptr<uhh2::Selection> lumi_sel;
  std::unique_ptr<uhh2::AndSelection> metfilters_sel;
  //  std::unique_ptr<uhh2::AndSelection> metantifilters_sel;

  std::unique_ptr<uhh2::Selection> genmttbar_sel;
  std::unique_ptr<uhh2::Selection> genflavor_sel;

  std::unique_ptr<uhh2::Selection> jet2_sel;
  std::unique_ptr<uhh2::Selection> jet1_sel;
  std::unique_ptr<uhh2::Selection> met_sel;
  std::unique_ptr<uhh2::Selection> htlep_sel;
  std::unique_ptr<uhh2::Selection> twodcut_sel;

  std::unique_ptr<uhh2::AnalysisModule> ttgenprod;
  uhh2::Event::Handle<TTbarGen> h_ttbar_gen;

  //run numbers for different jet corrections
  const int runnr_BCD = 276811;
  const int runnr_EF = 278802;
  const int runnr_G = 280385;
  bool isMC;

  Event::Handle<float> tt_TMVA_response;// response of TMVA method, dummy value at this step
  Event::Handle<float> wjets_TMVA_response;     // response of TMVA method, dummy value at this step
  Event::Handle<float> H_Rec_chi2;     
  Event::Handle<float>    h_lep1__pTrel_jet_norm;     //11                                                                                                            
  Event::Handle<float>    h_ht_met_lep_norm;          //12                                                                                                            
  Event::Handle<float>    h_jet1_csv;                //13                                                                                                             
  Event::Handle<float>    h_jet2_csv;                //14                                                                                                             
  Event::Handle<float>    h_DRpt;                     //15                                                                                                            
  Event::Handle<float>    h_njets;                    //16                                                                                                            
  Event::Handle<float>    h_jet1_m;                  //17                                                                                                             
  Event::Handle<float>    h_jet2_m;                  //18                                                                                                             
  Event::Handle<float>    h_lep1__minDR_norm;   //19                                                                                                                  
  Event::Handle<float> h_s33;                      

  bool isQCDstudy;
  std::unique_ptr<Hists> lumihists;
  std::string METcollection;
  //Runnumbers for applying different corrections
  constexpr static int s_runnr_BCD     = 276811; //up to this one, including this one
  constexpr static int s_runnr_EFearly = 278802; //up to this one, EXCLUDING this one
  constexpr static int s_runnr_Fearly  = 278802; //up to this one, EXCLUDING this one
  constexpr static int s_runnr_FlateG  = 280385; //up to this one, including this one

};

TTbarLJSkimmingModule::TTbarLJSkimmingModule(uhh2::Context& ctx){

  //// CONFIGURATION
 const std::string& _METcollection = ctx.get("METName");
 METcollection = _METcollection;
  const bool isMC = (ctx.get("dataset_type") == "MC");

  const std::string& keyword = ctx.get("keyword");
